SrvrtsRefDOCMGRDEMO/src/InformationRegisters/ОчередьПриемаСообщенийЭДО/ОчередьПриемаСообщенийЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПриемаСообщенийЭДО</name>
  <resources>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЭДПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ЭДПрисоединенныеФайлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SrvrtsRefDOCMGRDEMO/src/InformationRegisters/ОчередьПриемаСообщенийЭДО/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Добавляет запись.
//
Процедура ДобавитьЗапись(ЭДПрисоединенныйФайл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьПриемаСообщенийЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭДПрисоединенныйФайл", ЭДПрисоединенныйФайл);
	БлокировкаДанных.Заблокировать();
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ЭДПрисоединенныйФайл = ЭДПрисоединенныйФайл;
	Запись.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ДобавитьПопыткуОбработки(ЭДПрисоединенныйФайл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ОчередьПриемаСообщенийЭДО.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЭДПрисоединенныйФайл = ЭДПрисоединенныйФайл;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.КоличествоПопытокОбработки =
			МенеджерЗаписи.КоличествоПопытокОбработки + 1;
		МенеджерЗаписи.Записать();
		
		Возврат МенеджерЗаписи.КоличествоПопытокОбработки;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Удаляет запись.
//
Процедура УдалитьЗапись(ЭДПрисоединенныйФайл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьПриемаСообщенийЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭДПрисоединенныйФайл", ЭДПрисоединенныйФайл);
	БлокировкаДанных.Заблокировать();
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ЭДПрисоединенныйФайл = ЭДПрисоединенныйФайл;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;	
	
	ЗафиксироватьТранзакцию();
		
КонецПроцедуры

#КонецОбласти
